<a href="https://colab.research.google.com/github/abeliansw/minGPT/blob/master/%EB%AA%A8%EC%9D%98%EA%B3%A0%EC%82%AC11_18%ED%9A%8C_%EC%8B%A4%EC%8A%B5.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
import pandas as pd
import numpy as np

# 기출문제 11회

In [ ]:
data11=pd.read_csv('Dataset_11.csv')

In [ ]:
data11.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 470 entries, 0 to 469
Data columns (total 4 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   Country          470 non-null    object
 1   Happiness_Rank   470 non-null    int64
 2   Happiness_Score  470 non-null    float64
 3   year             470 non-null    int64
dtypes: float64(1), int64(2), object(1)
memory usage: 14.8+ KB

In [ ]:
data11.head()

       Country  Happiness_Rank  Happiness_Score  year
0  Switzerland               1            7.587  2015
1      Iceland               2            7.561  2015
2      Denmark               3            7.527  2015
3       Norway               4            7.522  2015
4       Canada               5            7.427  2015

## Q1

In [ ]:
q11_1=data11.Country.value_counts()
q11_1

Switzerland                 3
Mongolia                    3
Lebanon                     3
Hungary                     3
Honduras                    3
                           ..
Puerto Rico                 1
Somaliland Region           1
Oman                        1
Taiwan Province of China    1
Hong Kong S.A.R. China      1
Name: Country, Length: 166, dtype: int64

In [ ]:
q11_1_list=q11_1.index[q11_1 == 3]
q11_1_list

Index(['Switzerland', 'Mongolia', 'Lebanon', 'Hungary', 'Honduras',
       'Tajikistan', 'Tunisia', 'Palestinian Territories', 'Bangladesh',
       'Iran',
       ...
       'Ecuador', 'Italy', 'Slovakia', 'Bolivia', 'Moldova', 'Japan',
       'Paraguay', 'Slovenia', 'Lithuania', 'South Korea'],
      dtype='object', length=146)

In [ ]:
# 답
q11_1_list_out=q11_1.index[q11_1 < 3]
len(q11_1_list_out)

20

In [ ]:
q11_1_2=pd.pivot_table(data11, index='Country', columns='year', values='Happiness_Score', aggfunc='count')

In [ ]:
q11_1_2

year         2015  2016  2017
Country
Afghanistan   1.0   1.0   1.0
Albania       1.0   1.0   1.0
Algeria       1.0   1.0   1.0
Angola        1.0   1.0   1.0
Argentina     1.0   1.0   1.0
...           ...   ...   ...
Venezuela     1.0   1.0   1.0
Vietnam       1.0   1.0   1.0
Yemen         1.0   1.0   1.0
Zambia        1.0   1.0   1.0
Zimbabwe      1.0   1.0   1.0

[166 rows x 3 columns]

In [ ]:
q11_1_2['sum'] = q11_1_2.sum(axis=1)

In [ ]:
q11_1_2

year         2015  2016  2017  sum
Country
Afghanistan   1.0   1.0   1.0  3.0
Albania       1.0   1.0   1.0  3.0
Algeria       1.0   1.0   1.0  3.0
Angola        1.0   1.0   1.0  3.0
Argentina     1.0   1.0   1.0  3.0
...           ...   ...   ...  ...
Venezuela     1.0   1.0   1.0  3.0
Vietnam       1.0   1.0   1.0  3.0
Yemen         1.0   1.0   1.0  3.0
Zambia        1.0   1.0   1.0  3.0
Zimbabwe      1.0   1.0   1.0  3.0

[166 rows x 4 columns]

In [ ]:
q11_1_2['sum'] < 3.0

Country
Afghanistan    False
Albania        False
Algeria        False
Angola         False
Argentina      False
               ...
Venezuela      False
Vietnam        False
Yemen          False
Zambia         False
Zimbabwe       False
Name: sum, Length: 166, dtype: bool

In [ ]:
len(q11_1_2[q11_1_2['sum'] < 3.0])

20

## Q2

In [ ]:
q11_2 = pd.pivot_table(data11, index='Country', columns='year', values='Happiness_Score').dropna()
len(q11_2)

146

In [ ]:
len(q11_1_list)

146

In [ ]:
q11_2

year          2015   2016   2017
Country
Afghanistan  3.575  3.360  3.794
Albania      4.959  4.655  4.644
Algeria      5.605  6.355  5.872
Angola       4.033  3.866  3.795
Argentina    6.574  6.650  6.599
...            ...    ...    ...
Venezuela    6.810  6.084  5.250
Vietnam      5.360  5.061  5.074
Yemen        4.077  3.724  3.593
Zambia       5.129  4.795  4.514
Zimbabwe     4.610  4.193  3.875

[146 rows x 3 columns]

In [ ]:
q11_2['ratio']=(q11_2[2017] - q11_2[2015])/2
q11_2

year          2015   2016   2017   ratio
Country
Afghanistan  3.575  3.360  3.794  0.1095
Albania      4.959  4.655  4.644 -0.1575
Algeria      5.605  6.355  5.872  0.1335
Angola       4.033  3.866  3.795 -0.1190
Argentina    6.574  6.650  6.599  0.0125
...            ...    ...    ...     ...
Venezuela    6.810  6.084  5.250 -0.7800
Vietnam      5.360  5.061  5.074 -0.1430
Yemen        4.077  3.724  3.593 -0.2420
Zambia       5.129  4.795  4.514 -0.3075
Zimbabwe     4.610  4.193  3.875 -0.3675

[146 rows x 4 columns]

In [ ]:
# 답
q11_2.ratio.nlargest(3).index

Index(['Latvia', 'Romania', 'Togo'], dtype='object', name='Country')

## Q3

In [ ]:
import scipy.stats as st  # one-way 만 가능

from statsmodels.formula.api import ols  # two-way 이상 가능
from statsmodels.stats.anova import anova_lm

In [ ]:
q11_3=q11_2.drop(columns='ratio')

In [ ]:
q11_3

year          2015   2016   2017
Country
Afghanistan  3.575  3.360  3.794
Albania      4.959  4.655  4.644
Algeria      5.605  6.355  5.872
Angola       4.033  3.866  3.795
Argentina    6.574  6.650  6.599
...            ...    ...    ...
Venezuela    6.810  6.084  5.250
Vietnam      5.360  5.061  5.074
Yemen        4.077  3.724  3.593
Zambia       5.129  4.795  4.514
Zimbabwe     4.610  4.193  3.875

[146 rows x 3 columns]

In [ ]:
st.f_oneway(q11_3[2015], q11_3[2016], q11_3[2017])

F_onewayResult(statistic=0.004276725037689305, pvalue=0.9957324489944479)

In [ ]:
?st.f_oneway

In [ ]:
st.f_oneway(*q11_3.values.T, axis=0)

F_onewayResult(statistic=0.004276725037689305, pvalue=0.9957324489944479)

In [ ]:
q11_3_2=data11[data11.Country.isin(q11_1_list)]

In [ ]:
q11_3_2.columns

Index(['Country', 'Happiness_Rank', 'Happiness_Score', 'year'], dtype='object')

In [ ]:
anova1=ols('Happiness_Score~C(year)', data=q11_3_2).fit()

In [ ]:
anova1.summary()

<class 'statsmodels.iolib.summary.Summary'>
"""
                            OLS Regression Results
==============================================================================
Dep. Variable:        Happiness_Score   R-squared:                       0.000
Model:                            OLS   Adj. R-squared:                 -0.005
Method:                 Least Squares   F-statistic:                  0.004277
Date:                Sat, 29 Jul 2023   Prob (F-statistic):              0.996
Time:                        10:41:50   Log-Likelihood:                -678.98
No. Observations:                 438   AIC:                             1364.
Df Residuals:                     435   BIC:                             1376.
Df Model:                           2
Covariance Type:            nonrobust
===================================================================================
                      coef    std err          t      P>|t|      [0.025      0.975]
-----------------------------------------------------------------------------------
Intercept           5.3959      0.095     56.983      0.000       5.210       5.582
C(year)[T.2016]    -0.0112      0.134     -0.084      0.933      -0.274       0.252
C(year)[T.2017]    -0.0010      0.134     -0.007      0.994      -0.264       0.262
==============================================================================
Omnibus:                       41.991   Durbin-Watson:                   0.078
Prob(Omnibus):                  0.000   Jarque-Bera (JB):               13.285
Skew:                           0.050   Prob(JB):                      0.00130
Kurtosis:                       2.153   Cond. No.                         3.73
==============================================================================

Notes:
[1] Standard Errors assume that the covariance matrix of the errors is correctly specified.
"""

In [ ]:
anova_lm(anova1)

             df      sum_sq   mean_sq         F    PR(>F)
C(year)     2.0    0.011198  0.005599  0.004277  0.995732
Residual  435.0  569.472307  1.309132       NaN       NaN

In [ ]:
# 답
np.trunc(anova_lm(anova1)['F'][0]*10000) / 10000

0.0042

In [ ]:
from statsmodels.stats.multicomp import pairwise_tukeyhsd

In [ ]:
# ?pairwise_tukeyhsd

In [ ]:
# 참고 다중비교
print(pairwise_tukeyhsd(q11_3_2.Happiness_Score, q11_3_2.year))

Multiple Comparison of Means - Tukey HSD, FWER=0.05
==================================================
group1 group2 meandiff p-adj  lower  upper  reject
--------------------------------------------------
  2015   2016  -0.0112   0.9 -0.3261 0.3038  False
  2015   2017   -0.001   0.9 -0.3159  0.314  False
  2016   2017   0.0102   0.9 -0.3048 0.3251  False
--------------------------------------------------

# 모의고사 12

In [ ]:
data12 = pd.read_csv('Dataset_12.csv')

## Q1

In [ ]:
data12.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5000 entries, 0 to 4999
Data columns (total 7 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   Age                 5000 non-null   int64
 1   Gender              5000 non-null   object
 2   Dependent_Count     5000 non-null   int64
 3   Education_Level     5000 non-null   object
 4   is_Married          5000 non-null   int64
 5   Read_Book_per_Year  5000 non-null   int64
 6   Income_Range        5000 non-null   object
dtypes: int64(4), object(3)
memory usage: 273.6+ KB

In [ ]:
num_list=data12.columns[data12.dtypes != 'object']
num_list

Index(['Age', 'Dependent_Count', 'is_Married', 'Read_Book_per_Year'], dtype='object')

In [ ]:
data12[num_list].corr()

                         Age  Dependent_Count  is_Married  Read_Book_per_Year
Age                 1.000000        -0.143767    0.040360            0.796843
Dependent_Count    -0.143767         1.000000    0.024472           -0.132591
is_Married          0.040360         0.024472    1.000000            0.027221
Read_Book_per_Year  0.796843        -0.132591    0.027221            1.000000

## Q2

In [ ]:
data12.Education_Level.unique()

array(['석사', '박사', '학사', '고졸'], dtype=object)

In [ ]:
data12_2_1=data12[data12.Education_Level.isin(['석사', '박사'])]['Read_Book_per_Year']
data12_2_0=data12[~data12.Education_Level.isin(['석사', '박사'])]['Read_Book_per_Year']

In [ ]:
# 답
q12_2_out=st.ttest_ind(data12_2_1, data12_2_0, equal_var=True)
q12_2_out.pvalue

0.2685589229897138

## Q3

In [ ]:
q12_3=data12[data12.Education_Level.isin(['석사', '박사'])]
q12_3_2=q12_3[q12_3.Income_Range != 'X']

In [ ]:
q12_3_2.Income_Range.value_counts()

A    997
B    450
D    414
C    346
E    184
Name: Income_Range, dtype: int64

In [ ]:
q12_3_list=num_list.drop('Read_Book_per_Year')

In [ ]:
from sklearn.linear_model import LinearRegression

In [ ]:
lm=LinearRegression().fit(q12_3_2[q12_3_list], q12_3_2['Read_Book_per_Year'])

In [ ]:
q12_3_list

Index(['Age', 'Dependent_Count', 'is_Married'], dtype='object')

In [ ]:
lm.coef_

array([ 0.79476583, -0.22882582,  0.14567566])

In [ ]:
# 답
lm.coef_[0] * (40-30)

7.947658328251059

## 모의고사 13

In [ ]:
import pandas as pd

In [ ]:
data13 = pd.read_csv("Dataset_13_train.csv")

In [ ]:
data13.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1500 entries, 0 to 1499
Data columns (total 10 columns):
 #   Column                  Non-Null Count  Dtype
---  ------                  --------------  -----
 0   city_development_index  1500 non-null   float64
 1   gender                  1500 non-null   object
 2   relevent_experience     1500 non-null   int64
 3   enrolled_university     1500 non-null   int64
 4   education_level         1500 non-null   object
 5   major_discipline        1500 non-null   object
 6   experience              1500 non-null   int64
 7   last_new_job            1500 non-null   int64
 8   training_hours          1500 non-null   int64
 9   target                  1500 non-null   int64
dtypes: float64(1), int64(6), object(3)
memory usage: 117.3+ KB

In [ ]:
data13.columns
# ['city_development_index', 'gender', 'relevent_experience',
#        'enrolled_university', 'education_level', 'major_discipline',
#        'experience', 'last_new_job', 'training_hours', 'target']

Index(['city_development_index', 'gender', 'relevent_experience',
       'enrolled_university', 'education_level', 'major_discipline',
       'experience', 'last_new_job', 'training_hours', 'target'],
      dtype='object')

## Q1

In [ ]:
data13.groupby('gender')[['experience', 'last_new_job']].corr()

# (정답) 0.45

                     experience  last_new_job
gender
Female experience      1.000000      0.451898
       last_new_job    0.451898      1.000000
Male   experience      1.000000      0.411155
       last_new_job    0.411155      1.000000

## Q2

In [ ]:
# (1) 데이터 타입 변경
q2=data13.copy()
q2['target']=q2['target'].astype(str)
q2['target'].dtype

dtype('O')

In [ ]:
# (2) 조건에 해당하는 데이터 필터링

q2['major_discipline'].value_counts()

base=q2['city_development_index'].quantile(0.85)

q2_1=q2[(q2['major_discipline']=='STEM') &
   (q2['city_development_index'] > base)]

In [ ]:
# (3) 범주형 데이터의 독립성 검정 : 카이스퀘어 검정
from scipy.stats import chi2_contingency

In [ ]:
q2_tab=pd.crosstab(index=q2_1.relevent_experience,
                     columns=q2_1.target)

q2_out=chi2_contingency(q2_tab)[1]

# (41.16381604042102,
#  1.3999022544385146e-10,
#  1,
#  array([[213.35891473,  73.64108527],
#         [745.64108527, 257.35891473]]))

round(q2_out,2)

# (정답) 0.64

0.64

## Q3

In [ ]:
x_var= data13.columns[data13.dtypes != 'object'].drop('target')

In [ ]:
from sklearn.tree import DecisionTreeClassifier

In [ ]:
dt=DecisionTreeClassifier(random_state=123).fit(data13[x_var], data13.target)

test=pd.read_csv('Dataset_13_test.csv')

In [ ]:
dt.score(test[x_var], test.target)

# (정답) 0.672
# (정답) 0.67  (이직 의사 변수를 문자열로 설정)

0.672

# 모의고사 14

In [ ]:
data14 = pd.read_csv("Dataset_14.csv")

In [ ]:
data14.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2000 entries, 0 to 1999
Data columns (total 9 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   id           2000 non-null   int64
 1   published    2000 non-null   object
 2   subject      2000 non-null   object
 3   level        2000 non-null   object
 4   price        2000 non-null   float64
 5   subscribers  2000 non-null   int64
 6   reviews      2000 non-null   int64
 7   lectures     2000 non-null   int64
 8   duration     2000 non-null   float64
dtypes: float64(2), int64(4), object(3)
memory usage: 140.8+ KB

## Q1

In [ ]:
data14["income"] = data14["price"] * data14["subscribers"]
data14["review_rate"] = data14["reviews"] / data14["subscribers"]
data14.head(2)

,id,published,subject,level,price,subscribers,reviews,lectures,duration,income,review_rate
0,1,2015-07-10,Business Finance,Beginner Level,1.7,56,8,18,2.000000,95.2,0.142857
1,2,2016-10-25,Business Finance,All Levels,17.4,336,6,13,0.683333,5846.4,0.017857

In [ ]:
sum((data14["income"] >= 10000) & (data14["review_rate"] >= 0.1))

# (정답) 59

59

## Q2

In [ ]:
data14["published"] = pd.to_datetime(data14["published"])
data14["year"] = data14["published"].dt.year
data14.head(2)

,id,published,subject,level,price,subscribers,reviews,lectures,duration,income,review_rate,year
0,1,2015-07-10,Business Finance,Beginner Level,1.7,56,8,18,2.000000,95.2,0.142857,2015
1,2,2016-10-25,Business Finance,All Levels,17.4,336,6,13,0.683333,5846.4,0.017857,2016

In [ ]:
data14_sub = data14.loc[(data14["year"] == 2016) & (data14["subject"] == "Web Development"), ]
data14_sub.head(2)

,id,published,subject,level,price,subscribers,reviews,lectures,duration,income,review_rate,year
6,7,2016-10-24,Web Development,Intermediate Level,17.4,9773,117,65,4.5,170050.2,0.011972,2016
36,37,2016-04-05,Web Development,All Levels,17.0,12068,81,12,1.5,205156.0,0.006712,2016

In [ ]:
round(data14_sub[['price', 'subscribers']].corr()['price']['subscribers'],2) # (정답) 0.03

0.03

## Q3

In [ ]:
from statsmodels.formula.api import ols
from statsmodels.stats.anova import anova_lm

In [ ]:
model = ols(formula = "review_rate ~ C(year)", data = data14).fit()
anova_lm(model)

              df     sum_sq   mean_sq          F        PR(>F)
C(year)      2.0   0.365685  0.182842  18.542038  1.049908e-08
Residual  1997.0  19.692334  0.009861        NaN           NaN

In [ ]:
round(anova_lm(model)['F'][0], 1)   # (정답) 18.5

18.5

# 모의고사 15

- 중급수준의 문제라 스킵합니다.

# 모의고사 16

In [ ]:
data16=pd.read_csv('employ.csv')

In [ ]:
data16.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8165 entries, 0 to 8164
Data columns (total 8 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   EmployeeNumber  8165 non-null   int64
 1   Gender          8165 non-null   int64
 2   City            8165 non-null   object
 3   JobTitle        8165 non-null   object
 4   Age             8165 non-null   float64
 5   LengthService   8165 non-null   float64
 6   AbsentHours     8165 non-null   float64
 7   AbsentRate      8165 non-null   float64
dtypes: float64(4), int64(2), object(2)
memory usage: 510.4+ KB

In [ ]:
data16.columns

Index(['EmployeeNumber', 'Gender', 'City', 'JobTitle', 'Age', 'LengthService',
       'AbsentHours', 'AbsentRate'],
      dtype='object')

## Q1

In [ ]:
# q16_1 = data16.copy()

In [ ]:
q16_1 = data16[data16.AbsentHours > 0]

In [ ]:
# 답
q16_1.City.value_counts().max()

1453

## Q2

In [ ]:
q16_2=data16.copy()
q16_2.columns

Index(['EmployeeNumber', 'Gender', 'City', 'JobTitle', 'Age', 'LengthService',
       'AbsentHours', 'AbsentRate'],
      dtype='object')

In [ ]:
q16_2['AbsentOver'] = np.where(q16_2.AbsentHours > 151 , 1, 0)

In [ ]:
q16_2_tab=pd.crosstab(index=q16_2.AbsentOver, columns=q16_2.Gender)
q16_2_tab

Gender         0     1
AbsentOver
0           3787  4052
1            230    96

In [ ]:
q16_2_out=st.chi2_contingency(q16_2_tab, correction=False)
q16_2_out

(61.95233911930612,
 3.518715775970246e-15,
 1,
 array([[3856.61518677, 3982.38481323],
        [ 160.38481323,  165.61518677]]))

In [ ]:
# 답
np.trunc(q16_2_out[0] * 100) / 100

61.95

## Q3

In [ ]:
q16_3_list=['Age', 'LengthService', 'Gender']

In [ ]:
lm=LinearRegression().fit(data16[q16_3_list], data16['AbsentRate'])

In [ ]:
q16_test=data16[q16_3_list].reset_index(drop=True)
q16_test['Age'] = q16_test['Age'] + 1
q16_test['LengthService'] = q16_test['LengthService'] + 1

In [ ]:
q16_pred=lm.predict(q16_test[q16_3_list])

In [ ]:
# 답
round(q16_pred.mean(),2)

3.03

## 모의고사 17

In [ ]:
data17=pd.read_csv('BlackFriday.csv')

In [ ]:
data17.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 465342 entries, 0 to 465341
Data columns (total 33 columns):
 #   Column                      Non-Null Count   Dtype
---  ------                      --------------   -----
 0   User_ID                     465342 non-null  int64
 1   Product_ID                  465342 non-null  object
 2   Gender                      465342 non-null  int64
 3   Age                         465342 non-null  object
 4   City_Category               465342 non-null  object
 5   Stay_In_Current_City_Years  465342 non-null  float64
 6   Marital_Status              465342 non-null  int64
 7   Product_Category            465342 non-null  int64
 8   Purchase                    465342 non-null  int64
 9   Type                        465342 non-null  object
 10  VIP                         465342 non-null  int64
 11  City_Category_B             465342 non-null  int64
 12  City_Category_C             465342 non-null  int64
 13  Occupation_1                465342 non-null  int64
 14  Occupation_2                465342 non-null  int64
 15  Occupation_3                465342 non-null  int64
 16  Occupation_4                465342 non-null  int64
 17  Occupation_5                465342 non-null  int64
 18  Occupation_6                465342 non-null  int64
 19  Occupation_7                465342 non-null  int64
 20  Occupation_8                465342 non-null  int64
 21  Occupation_9                465342 non-null  int64
 22  Occupation_10               465342 non-null  int64
 23  Occupation_11               465342 non-null  int64
 24  Occupation_12               465342 non-null  int64
 25  Occupation_13               465342 non-null  int64
 26  Occupation_14               465342 non-null  int64
 27  Occupation_15               465342 non-null  int64
 28  Occupation_16               465342 non-null  int64
 29  Occupation_17               465342 non-null  int64
 30  Occupation_18               465342 non-null  int64
 31  Occupation_19               465342 non-null  int64
 32  Occupation_20               465342 non-null  int64
dtypes: float64(1), int64(28), object(4)
memory usage: 117.2+ MB

In [ ]:
data17.columns

Index(['User_ID', 'Product_ID', 'Gender', 'Age', 'City_Category',
       'Stay_In_Current_City_Years', 'Marital_Status', 'Product_Category',
       'Purchase', 'Type', 'VIP', 'City_Category_B', 'City_Category_C',
       'Occupation_1', 'Occupation_2', 'Occupation_3', 'Occupation_4',
       'Occupation_5', 'Occupation_6', 'Occupation_7', 'Occupation_8',
       'Occupation_9', 'Occupation_10', 'Occupation_11', 'Occupation_12',
       'Occupation_13', 'Occupation_14', 'Occupation_15', 'Occupation_16',
       'Occupation_17', 'Occupation_18', 'Occupation_19', 'Occupation_20'],
      dtype='object')

In [ ]:
q17_1=data17.groupby('City_Category')['Purchase'].median()
q17_1

City_Category
A    7934.0
B    8002.0
C    8585.0
Name: Purchase, dtype: float64

In [ ]:
# 답
int(abs(q17_1.max() - q17_1.min()))

651

## Q2

In [ ]:
data17.head()

,User_ID,Product_ID,Gender,Age,City_Category,Stay_In_Current_City_Years,Marital_Status,Product_Category,Purchase,Type,...,Occupation_11,Occupation_12,Occupation_13,Occupation_14,Occupation_15,Occupation_16,Occupation_17,Occupation_18,Occupation_19,Occupation_20
0,1004918,P00251242,0,18-25,C,1.0,0,5,7041,train,...,0,1,0,0,0,0,0,0,0,0
1,1004918,P00216342,0,18-25,C,1.0,0,3,8385,train,...,0,1,0,0,0,0,0,0,0,0
2,1004918,P00154042,0,18-25,C,1.0,0,1,11393,train,...,0,1,0,0,0,0,0,0,0,0
3,1004918,P00065442,0,18-25,C,1.0,0,8,7977,train,...,0,1,0,0,0,0,0,0,0,0
4,1004918,P00343042,0,18-25,C,1.0,0,5,6858,train,...,0,1,0,0,0,0,0,0,0,0

In [ ]:
data17.Age.unique()

array(['18-25', '26-35', '36-45', '46-50', '55+', '51-55', '0-17'],
      dtype=object)

In [ ]:
data17_2=data17[data17.Age.isin(['46-50','51-55'])]

In [ ]:
data17_2.columns

Index(['User_ID', 'Product_ID', 'Gender', 'Age', 'City_Category',
       'Stay_In_Current_City_Years', 'Marital_Status', 'Product_Category',
       'Purchase', 'Type', 'VIP', 'City_Category_B', 'City_Category_C',
       'Occupation_1', 'Occupation_2', 'Occupation_3', 'Occupation_4',
       'Occupation_5', 'Occupation_6', 'Occupation_7', 'Occupation_8',
       'Occupation_9', 'Occupation_10', 'Occupation_11', 'Occupation_12',
       'Occupation_13', 'Occupation_14', 'Occupation_15', 'Occupation_16',
       'Occupation_17', 'Occupation_18', 'Occupation_19', 'Occupation_20'],
      dtype='object')

In [ ]:
data17_2_tab=pd.pivot_table(data=data17_2, index='User_ID',
                            columns='Age', values='Purchase', aggfunc='sum')
data17_2_tab

Age          46-50      51-55
User_ID
1000004   206468.0        NaN
1000006        NaN   379930.0
1000013   713927.0        NaN
1000017        NaN  1425995.0
1000033  1940418.0        NaN
...            ...        ...
1006014   528238.0        NaN
1006016  3770970.0        NaN
1006020        NaN   374475.0
1006032   517261.0        NaN
1006033        NaN   501843.0

[855 rows x 2 columns]

In [ ]:
q17_2_out=st.ttest_ind(data17_2_tab['46-50'].dropna(), data17_2_tab['51-55'].dropna(), equal_var=True)
q17_2_out

Ttest_indResult(statistic=0.2925821214722024, pvalue=0.7699127341050495)

In [ ]:
# 답
q17_2_out.pvalue   # 0.769

0.7699127341050495

## Q3

In [ ]:
data17.columns

Index(['User_ID', 'Product_ID', 'Gender', 'Age', 'City_Category',
       'Stay_In_Current_City_Years', 'Marital_Status', 'Product_Category',
       'Purchase', 'Type', 'VIP', 'City_Category_B', 'City_Category_C',
       'Occupation_1', 'Occupation_2', 'Occupation_3', 'Occupation_4',
       'Occupation_5', 'Occupation_6', 'Occupation_7', 'Occupation_8',
       'Occupation_9', 'Occupation_10', 'Occupation_11', 'Occupation_12',
       'Occupation_13', 'Occupation_14', 'Occupation_15', 'Occupation_16',
       'Occupation_17', 'Occupation_18', 'Occupation_19', 'Occupation_20'],
      dtype='object')

In [ ]:
q17_3_list=[ 'Gender', 'City_Category_B', 'City_Category_C',
       'Occupation_1', 'Occupation_2', 'Occupation_3', 'Occupation_4',
       'Occupation_5', 'Occupation_6', 'Occupation_7', 'Occupation_8',
       'Occupation_9', 'Occupation_10', 'Occupation_11', 'Occupation_12',
       'Occupation_13', 'Occupation_14', 'Occupation_15', 'Occupation_16',
       'Occupation_17', 'Occupation_18', 'Occupation_19', 'Occupation_20', 'Marital_Status']

len(q17_3_list)

24

In [ ]:
q17_train=data17[data17.Type == 'train']
q17_test=data17[data17.Type == 'test']

In [ ]:
from sklearn.linear_model import LogisticRegression

In [ ]:
logit=LogisticRegression(solver='newton-cg', C=100000, random_state=123)
logit.fit(q17_train[q17_3_list], q17_train['VIP'])

LogisticRegression(C=100000, random_state=123, solver='newton-cg')

In [ ]:
q17_3_pred=logit.predict(q17_test[q17_3_list])

In [ ]:
from sklearn.metrics import recall_score

In [ ]:
# 답
round(recall_score(q17_test['VIP'], q17_3_pred, pos_label=1),2)

0.98

# 모의고사 18

In [ ]:
data18=pd.read_csv('seoul_air2.csv')

In [ ]:
data18.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2190 entries, 0 to 2189
Data columns (total 9 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Date      2190 non-null   int64
 1   Location  2190 non-null   object
 2   PM10      2190 non-null   float64
 3   PM25      2190 non-null   float64
 4   O3        2190 non-null   float64
 5   NO2       2190 non-null   float64
 6   CO        2190 non-null   float64
 7   SO2       2190 non-null   float64
 8   Warning   2190 non-null   int64
dtypes: float64(6), int64(2), object(1)
memory usage: 154.1+ KB

In [ ]:
data18.head()

,Date,Location,PM10,PM25,O3,NO2,CO,SO2,Warning
0,20210101,강남구,22.045455,16.272727,0.014727,0.027136,0.522727,0.003955,0
1,20210102,강남구,26.833333,11.833333,0.024875,0.015375,0.404167,0.003583,0
2,20210103,강남구,30.291667,13.750000,0.022000,0.018042,0.429167,0.003708,0
3,20210104,강남구,33.208333,23.750000,0.006500,0.039333,0.591667,0.003958,0
4,20210105,강남구,22.208333,15.833333,0.022042,0.019833,0.416667,0.003250,0

In [ ]:
data18.Location.value_counts()

강남구     365
강북구     365
노원구     365
동작구     365
영등포구    365
종로구     365
Name: Location, dtype: int64

## Q1

In [ ]:
data18.columns

Index(['Date', 'Location', 'PM10', 'PM25', 'O3', 'NO2', 'CO', 'SO2',
       'Warning'],
      dtype='object')

In [ ]:
q18_1=data18.copy()
q18_1.Date = pd.to_datetime(q18_1.Date, format='%Y%m%d')
q18_1.Date_str = data18.Date.astype('str')
# q18_1.Date_str = data18.Date.apply('str')

C:\Users\MYCOM\AppData\Local\Temp/ipykernel_27364/2678759265.py:3: UserWarning: Pandas doesn't allow columns to be created via a new attribute name - see https://pandas.pydata.org/pandas-docs/stable/indexing.html#attribute-access
  q18_1.Date_str = data18.Date.astype('str')

In [ ]:
q18_1.Date_str

0       20210101
1       20210102
2       20210103
3       20210104
4       20210105
          ...
2185    20211227
2186    20211228
2187    20211229
2188    20211230
2189    20211231
Name: Date, Length: 2190, dtype: object

In [ ]:
q18_1.Date_str.str.slice(4, 6) == '03'

0       False
1       False
2       False
3       False
4       False
        ...
2185    False
2186    False
2187    False
2188    False
2189    False
Name: Date, Length: 2190, dtype: bool

In [ ]:
q18_1.Date.dt.month.value_counts()

1     186
3     186
5     186
7     186
8     186
10    186
12    186
4     180
6     180
9     180
11    180
2     168
Name: Date, dtype: int64

In [ ]:
q18_1_out=q18_1[q18_1.Date.dt.month == 3].groupby('Location')['PM10'].mean()
q18_1_out

Location
강남구     64.214244
강북구     66.406849
노원구     61.960717
동작구     68.843783
영등포구    63.978536
종로구     69.265670
Name: PM10, dtype: float64

In [ ]:
# 답
q18_1_out.idxmax()

'종로구'

## Q2

In [ ]:
q18_2_tab=pd.crosstab(index=data18.Warning, columns=data18.Location)

In [ ]:
# 답
round(st.chi2_contingency(q18_2_tab, correction=False)[0],2)

3.11

## Q3

In [ ]:
data18.columns

Index(['Date', 'Location', 'PM10', 'PM25', 'O3', 'NO2', 'CO', 'SO2',
       'Warning'],
      dtype='object')

In [ ]:
q18_3_list1=['PM10', 'PM25', 'O3', 'NO2', 'CO', 'SO2']

In [ ]:
q18_3=pd.pivot_table(data=data18, index='Date', values=q18_3_list1).reset_index()

In [ ]:
q18_3

         Date        CO       NO2        O3       PM10       PM25       SO2
0    20210101  0.546843  0.027037  0.015163  27.035354  17.587121  0.003402
1    20210102  0.399306  0.014271  0.025771  33.145833  12.236111  0.003132
2    20210103  0.464583  0.019729  0.020458  36.958333  14.673611  0.003299
3    20210104  0.616327  0.037327  0.008284  38.879244  23.461419  0.003565
4    20210105  0.410450  0.018110  0.022117  27.322821  16.001784  0.002919
..        ...       ...       ...       ...        ...        ...       ...
360  20211227  0.613005  0.035854  0.008583  34.148990  19.440025  0.002992
361  20211228  0.854861  0.044674  0.002882  53.527778  38.076389  0.003368
362  20211229  0.793750  0.036424  0.010750  64.993056  46.340278  0.003729
363  20211230  0.370076  0.016765  0.025908  29.052399  14.664773  0.003128
364  20211231  0.327778  0.012792  0.029437  23.298611   6.840278  0.002674

[365 rows x 7 columns]

In [ ]:
q18_3.columns

Index(['Date', 'CO', 'NO2', 'O3', 'PM10', 'PM25', 'SO2'], dtype='object')

In [ ]:
q18_3['Y'] = np.where((q18_3.PM10 > 30) | (q18_3.PM25 > 40), 1, 0)

In [ ]:
q18_3['Date']=q18_3.Date.astype('str')
train = q18_3[q18_3['Date'].str.slice(4, 6) != '07']
test = q18_3[q18_3['Date'].str.slice(4, 6) == '07']

In [ ]:
from sklearn.tree import DecisionTreeClassifier

In [ ]:
dt=DecisionTreeClassifier(random_state=123).fit(train[q18_3_list1], train['Y'])

In [ ]:
q18_3_pred=dt.predict(test[q18_3_list1])

In [ ]:
from sklearn.metrics import confusion_matrix

In [ ]:
# 답
confusion_matrix(test['Y'], q18_3_pred)[1,0]

0